testcase/constant/README
aggiungi chemistryProperties
