testcase/constant/reactions
reactions
{
    un-named-reaction-0
    {
        type            irreversibleArrhenius;
        reaction        "C3H8^0.5 + 5O2^1 = 3CO2 + 4H2O";
        A               1.65e+11;
        beta            0;
        Ta              15080;
    }
}
Tlow            200;
Thigh           5000;

