testcase/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

axialLines
{
    type sets;
    libs            ("libsampling.so");

    writeControl    adjustableRunTime;
    writeInterval   0.0005;

    fields          
    (
        T TMean TPrime2Mean
        U UMean UPrime2Mean
        O2 H2O C3H8
        p pMean pPrime2Mean
        CO2
    );

    interpolationScheme cellPoint;

    setFormat       raw;

    sets
    (
        lineA
        {
            type    lineUniform;
            axis    y;
            start   (0.01 0.0 0.0005);
            end     (0.01 0.5 0.0005);
            nPoints 1000;
        }
        
	lineB
        {
            type    lineUniform;
            axis    y;
            start   (0.03 0.0 0.0005);
            end     (0.03 0.5 0.0005);
            nPoints 1000;
        }
        
        lineC
        {
            type    lineUniform;
            axis    y;
            start   (0.06 0.0 0.0005);
            end     (0.06 0.5 0.0005);
            nPoints 1000;
        }
        
        lineD
        {
            type    lineUniform;
            axis    y;
            start   (0.1 0.0 0.0005);
            end     (0.1 0.5 0.0005);
            nPoints 1000;
        }
        
        lineE
        {
            type    lineUniform;
            axis    y;
            start   (0.15 0.0 0.0005);
            end     (0.15 0.5 0.0005);
            nPoints 1000;
        }
        
        lineF
        {
            type    lineUniform;
            axis    y;
            start   (0.25 0.0 0.0005);
            end     (0.25 0.5 0.0005);
            nPoints 1000;
        }
        

      
         line1
        {
            type    lineUniform;
            axis    x;
            start   (0.0 0.01 0.005);
            end     (0.3 0.01 0.005);
            nPoints 1000;
        }
        
         line2
        {
            type    lineUniform;
            axis    x;
            start   (0.0 0.02 0.005);
            end     (0.3 0.02 0.005);
            nPoints 1000;
        }
        
         line3
        {
            type    lineUniform;
            axis    x;
            start   (0.0 0.03 0.005);
            end     (0.3 0.03 0.005);
            nPoints 1000;
        }
        
          line4
        {
            type    lineUniform;
            axis    x;
            start   (0.0 0.04 0.005);
            end     (0.3 0.04 0.005);
            nPoints 1000;
        }
        
        flameA
        {
            type    lineUniform;
            axis    y;
            start   (0.02 0.04 0.0005);
            end     (0.02 0.015  0.0005);
            nPoints 1000;
        }
        
        flameB
        {
            type    lineUniform;
            axis    y;
            start   (0.07 0.03 0.0005);
            end     (0.07 0.2  0.0005);
            nPoints 1000;
        }
        
        flameC
        {
            type    lineUniform;
            axis    y;
            start   (0.021 0.02 0.0005);
            end     (0.021 0.1875  0.0005);
            nPoints 1000;
        }
    );
    
}

// ************************************************************************* //
